
//1. 임의의 양의 정수 세개가 마지막 숫자가 같은지 확인하시오.

function check1(x, y ,z){
    let a = x.substring(x.length-1, x.length);
    let b = y.substring(x.length-1, x.length);
    let c = z.substring(x.length-1, x.length);
    console.log(a);
    
}
check1(10,2,2);


// 2. 임의의 영문자를 받아 처음 세자를 소문자로 바꾸시오. 단 문자열의 길이가 3보다 작으면 모두 대문자로 변환합니다.


// 3. 두 수의 합이 50~80범위 안에 있으면 65를 반환하고 그렇지 않으면 80을 반환하시오.


// 4. 임의의 문자열을 받아 문자열을 거꾸로 출력하시오.

//   예) welcome ==> emoclew

// 5. 임의의 문자열을 받으면 그 단어의 첫 글자를 대문자로 바꾸어 출력하시오.


// 6. 주어진 숫자를 시간과 분으로 변환하는 스크립트를 작성하시오.


// 7. 주어진 문자열의 문자를 알파벳순으로 변환하는 스크립트를 작성하시오.

//    예) Python ==> Phnoty

// 8. 주어진 문자열의 첫번째 문자와 마지막 문자를 빼고 출력하시오.

// 9.두개의 문자를 받아 각 문자의 첫번째 문자를 제거한 후 두 문자를 연결하시오.

//   예) PHP, JS ==> HPS

// 10. 문자열이 "Los", 나 "New"로 시작하면 문자를 표시하고 그렇지 않으면 공백을 반환하시오.

//      단, Los, New는 대소문자를 무시합니다. 
